Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMG54G19.xml
          </instance>
        </module>
        <module name="MEM2MEM" version="11211A">
          <instance name="MEM2MEM">
            <register-group address-space="base" name="MEM2MEM" name-in-module="MEM2MEM" offset="0x40028000"/>
          </instance>
        </module>
        <module name="PDMIC" version="11237D">
          <instance name="PDMIC0">
            <register-group address-space="base" name="PDMIC0" name-in-module="PDMIC" offset="0x4002C000"/>
            <signals>
              <signal pad="PA10" function="B" group="PDMCLK" index="0"/>
              <signal pad="PA9" function="B" group="PDMDAT" index="0"/>
            </signals>
          </instance>
          <instance name="PDMIC1">
            <register-group address-space="base" name="PDMIC1" name-in-module="PDMIC" offset="0x40030000"/>
          </instance>
        </module>
        <module name="PIO" version="11004R">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
          </instance>
        </module>
        <module name="PMC" version="11116S">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x400E0400"/>
            <signals>
              <signal pad="PA6" function="B" group="PCK" index="0"/>
              <signal pad="PA17" function="B" group="PCK" index="1"/>
              <signal pad="PA21" function="B" group="PCK" index="1"/>
              <signal pad="PA18" function="B" group="PCK" index="2"/>
              <signal pad="PB3" function="B" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" version="11009I">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1400"/>
          </instance>
        </module>
        <module name="RTC" version="6056S">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1460"/>
          </instance>
        </module>
        <module name="RTT" version="6081M">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1430"/>
          </instance>
        </module>
        <module name="SPI" version="6088ZE">
          <instance name="SPI">
            <register-group address-space="base" name="SPI" name-in-module="SPI" offset="0x40008000"/>
            <signals>
              <signal pad="PA12" function="A" group="MISO"/>
              <signal pad="PA13" function="A" group="MOSI"/>
              <signal pad="PA11" function="A" group="NPCS" index="0"/>
              <signal pad="PA5" function="B" group="NPCS" index="1"/>
              <signal pad="PB2" function="B" group="NPCS" index="1"/>
              <signal pad="PA14" function="A" group="SPCK"/>
            </signals>
          </instance>
        </module>
        <module name="SUPC" version="11228E">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400E1410"/>
          </instance>
        </module>
        <module name="TC" version="6082ZB">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x40010000"/>
            <signals>
              <signal pad="PA2" function="A" group="TCLK" index="0"/>
              <signal pad="PA19" function="A" group="TCLK" index="1"/>
              <signal pad="PA20" function="A" group="TCLK" index="2"/>
              <signal pad="PA0" function="B" group="TIOA" index="0"/>
              <signal pad="PA23" function="B" group="TIOA" index="1"/>
              <signal pad="PA21" function="A" group="TIOA" index="2"/>
              <signal pad="PA1" function="B" group="TIOB" index="0"/>
              <signal pad="PA16" function="B" group="TIOB" index="1"/>
              <signal pad="PA22" function="A" group="TIOB" index="2"/>
            </signals>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0x40014000"/>
          </instance>
        </module>
        <module name="TWI" version="6212Z">
          <instance name="TWI1">
            <register-group address-space="base" name="TWI1" name-in-module="TWI" offset="0x4001C000"/>
            <signals>
              <signal pad="PB9" function="A" group="TWCK" index="1"/>
              <signal pad="PB11" function="A" group="TWCK" index="1"/>
              <signal pad="PB8" function="A" group="TWD" index="1"/>
              <signal pad="PB10" function="A" group="TWD" index="1"/>
            </signals>
          </instance>
          <instance name="TWI2">
            <register-group address-space="base" name="TWI2" name-in-module="TWI" offset="0x40040000"/>
            <signals>
              <signal pad="PB1" function="B" group="TWCK" index="2"/>
              <signal pad="PB11" function="B" group="TWCK" index="2"/>
              <signal pad="PB0" function="B" group="TWD" index="2"/>
              <signal pad="PB10" function="B" group="TWD" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="TWIHS" version="11210O">
          <instance name="TWI0">
            <register-group address-space="base" name="TWI0" name-in-module="TWIHS" offset="0x40018000"/>
            <signals>
              <signal pad="PA4" function="A" group="TWCK" index="0"/>
              <signal pad="PA3" function="A" group="TWD" index="0"/>
            </signals>
          </instance>
        </module>
        <module name="UART" version="6418N">
          <instance name="UART0">
            <register-group address-space="base" name="UART0" name-in-module="UART" offset="0x400E0600"/>
            <signals>
              <signal pad="PA9" function="A" group="URXD" index="0"/>
              <signal pad="PA10" function="A" group="UTXD" index="0"/>
            </signals>
          </instance>
          <instance name="UART1">
            <register-group address-space="base" name="UART1" name-in-module="UART" offset="0x400E0800"/>
            <signals>
              <signal pad="PB2" function="A" group="URXD" index="1"/>
              <signal pad="PB3" function="A" group="UTXD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="USART" version="6089ZN">
          <instance name="USART">
            <register-group address-space="base" name="USART" name-in-module="USART" offset="0x40024000"/>
            <signals>
              <signal pad="PA16" function="A" group="CTS"/>
              <signal pad="PA15" function="A" group="RTS"/>
              <signal pad="PA5" function="A" group="RXD"/>
              <signal pad="PA15" function="B" group="SCK"/>
              <signal pad="PA6" function="A" group="TXD"/>
            </signals>
          </instance>
        </module>
        <module name="WDT" version="6080H">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1450"/>
