Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMG54G19.xml
        <register caption="Master Configuration Register 1" name="MATRIX_MCFG1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG__ULBT"/>
        </register>
        <register caption="Master Configuration Register 2" name="MATRIX_MCFG2" offset="0x8" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG__ULBT"/>
        </register>
        <register caption="Slave Configuration Register 0" name="MATRIX_SCFG0" offset="0x40" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE" values="MATRIX_SCFG__DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register caption="Slave Configuration Register 1" name="MATRIX_SCFG1" offset="0x44" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE" values="MATRIX_SCFG__DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register caption="Slave Configuration Register 2" name="MATRIX_SCFG2" offset="0x48" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE" values="MATRIX_SCFG__DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register caption="Slave Configuration Register 3" name="MATRIX_SCFG3" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE" values="MATRIX_SCFG__DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register caption="Priority Register A for Slave 0" name="MATRIX_PRAS0" offset="0x0080" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
        </register>
        <register caption="Priority Register A for Slave 1" name="MATRIX_PRAS1" offset="0x0088" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
        </register>
        <register caption="Priority Register A for Slave 2" name="MATRIX_PRAS2" offset="0x0090" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
        </register>
        <register caption="Priority Register A for Slave 3" name="MATRIX_PRAS3" offset="0x0098" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
        </register>
        <register caption="System I/O Configuration Register" name="CCFG_SYSIO" offset="0x0114" rw="RW" size="4">
          <bitfield caption="PB4 or TDI Assignment" mask="0x00000010" name="SYSIO4"/>
          <bitfield caption="PB5 or TDO/TRACESWO Assignment" mask="0x00000020" name="SYSIO5"/>
          <bitfield caption="PB6 or TMS/SWDIO Assignment" mask="0x00000040" name="SYSIO6"/>
          <bitfield caption="PB7 or TCK/SWCLK Assignment" mask="0x00000080" name="SYSIO7"/>
          <bitfield caption="PB12 or ERASE Assignment" mask="0x00001000" name="SYSIO12"/>
        </register>
        <register caption="Write Protection Mode Register" name="MATRIX_WPMR" offset="0x1E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="MATRIX_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="MATRIX_WPSR" offset="0x1E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="MATRIX_MCFG__ULBT">
        <value caption="No predicted end of burst is generated and therefore INCR bursts coming from this master cannot be broken." name="INFINITE" value="0x0"/>
        <value caption="The undefined length burst is treated as a succession of single access allowing rearbitration at each beat of the INCR burst." name="SINGLE" value="0x1"/>
        <value caption="The undefined length burst is split into a 4-beat bursts allowing rearbitration at each 4-beat burst end." name="FOUR_BEAT" value="0x2"/>
        <value caption="The undefined length burst is split into 8-beat bursts allowing rearbitration at each 8-beat burst end." name="EIGHT_BEAT" value="0x3"/>
        <value caption="The undefined length burst is split into 16-beat bursts allowing rearbitration at each 16-beat burst end." name="SIXTEEN_BEAT" value="0x4"/>
      </value-group>
      <value-group caption="" name="MATRIX_MCFG__ULBT">
        <value caption="No predicted end of burst is generated and therefore INCR bursts coming from this master cannot be broken." name="INFINITE" value="0x0"/>
        <value caption="The undefined length burst is treated as a succession of single access allowing rearbitration at each beat of the INCR burst." name="SINGLE" value="0x1"/>
        <value caption="The undefined length burst is split into a 4-beat bursts allowing rearbitration at each 4-beat burst end." name="FOUR_BEAT" value="0x2"/>
        <value caption="The undefined length burst is split into 8-beat bursts allowing rearbitration at each 8-beat burst end." name="EIGHT_BEAT" value="0x3"/>
        <value caption="The undefined length burst is split into 16-beat bursts allowing rearbitration at each 16-beat burst end." name="SIXTEEN_BEAT" value="0x4"/>
      </value-group>
      <value-group caption="" name="MATRIX_MCFG__ULBT">
        <value caption="No predicted end of burst is generated and therefore INCR bursts coming from this master cannot be broken." name="INFINITE" value="0x0"/>
        <value caption="The undefined length burst is treated as a succession of single access allowing rearbitration at each beat of the INCR burst." name="SINGLE" value="0x1"/>
        <value caption="The undefined length burst is split into a 4-beat bursts allowing rearbitration at each 4-beat burst end." name="FOUR_BEAT" value="0x2"/>
        <value caption="The undefined length burst is split into 8-beat bursts allowing rearbitration at each 8-beat burst end." name="EIGHT_BEAT" value="0x3"/>
        <value caption="The undefined length burst is split into 16-beat bursts allowing rearbitration at each 16-beat burst end." name="SIXTEEN_BEAT" value="0x4"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="At the end of current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in having a one cycle latency for the first access of a burst transfer or for a single access." name="NO_DEFAULT" value="0x0"/>
        <value caption="At the end of current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having the one cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having the one cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="At the end of current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in having a one cycle latency for the first access of a burst transfer or for a single access." name="NO_DEFAULT" value="0x0"/>
        <value caption="At the end of current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having the one cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having the one cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="At the end of current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in having a one cycle latency for the first access of a burst transfer or for a single access." name="NO_DEFAULT" value="0x0"/>
        <value caption="At the end of current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having the one cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having the one cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="At the end of current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in having a one cycle latency for the first access of a burst transfer or for a single access." name="NO_DEFAULT" value="0x0"/>
        <value caption="At the end of current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having the one cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having the one cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x4D4154"/>
      </value-group>
    </module>
