Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMG54G19.xml
      <value-group caption="" name="SUPC_MR__PSWITCH2">
        <value caption="The SRAM2 is not powered." name="OFF" value="0"/>
        <value caption="The SRAM2 is powered." name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__BODRSTS">
        <value caption="No core brownout rising edge event has been detected since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one brownout output rising edge event has been detected since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMRSTS">
        <value caption="No supply monitor detection has generated a core reset since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one supply monitor detection has generated a core reset since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMS">
        <value caption="No supply monitor detection since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one supply monitor detection since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMOS">
        <value caption="The supply monitor detected VDDIO higher than its threshold at its last measurement." name="HIGH" value="0"/>
        <value caption="The supply monitor detected VDDIO lower than its threshold at its last measurement." name="LOW" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__OSCSEL">
        <value caption="The slow clock SLCK is generated by the embedded 32 kHz RC oscillator." name="RC" value="0"/>
        <value caption="The slow clock SLCK is generated by the 32 kHz crystal oscillator." name="CRYST" value="1"/>
      </value-group>
    </module>
    <module caption="Timer Counter" name="TC" version="6082ZB">
      <register-group name="TC">
        <register caption="Channel Control Register (channel = 0)" name="TC_CCR0" offset="0x0" rw="W" size="4">
          <bitfield caption="Counter Clock Enable Command" mask="0x00000001" name="CLKEN"/>
          <bitfield caption="Counter Clock Disable Command" mask="0x00000002" name="CLKDIS"/>
          <bitfield caption="Software Trigger Command" mask="0x00000004" name="SWTRG"/>
        </register>
        <register caption="Channel Mode Register (channel = 0)" name="TC_CMR0" offset="0x4" rw="RW" size="4">
          <bitfield caption="Clock Selection" mask="0x00000007" name="TCCLKS" values="TC_CMR0__TCCLKS"/>
          <bitfield caption="Clock Invert" mask="0x00000008" name="CLKI"/>
          <bitfield caption="Burst Signal Selection" mask="0x00000030" name="BURST" values="TC_CMR0__BURST"/>
          <bitfield caption="Counter Clock Stopped with RB Loading" mask="0x00000040" name="LDBSTOP"/>
          <bitfield caption="Counter Clock Disable with RB Loading" mask="0x00000080" name="LDBDIS"/>
          <bitfield caption="External Trigger Edge Selection" mask="0x00000300" name="ETRGEDG" values="TC_CMR0__ETRGEDG"/>
          <bitfield caption="TIOA or TIOB External Trigger Selection" mask="0x00000400" name="ABETRG"/>
          <bitfield caption="RC Compare Trigger Enable" mask="0x00004000" name="CPCTRG"/>
          <bitfield caption="Waveform Mode" mask="0x00008000" name="WAVE"/>
          <bitfield caption="RA Loading Edge Selection" mask="0x00030000" name="LDRA" values="TC_CMR0__LDRA"/>
          <bitfield caption="RB Loading Edge Selection" mask="0x000C0000" name="LDRB" values="TC_CMR0__LDRB"/>
        </register>
        <register caption="Stepper Motor Mode Register (channel = 0)" name="TC_SMMR0" offset="0x8" rw="RW" size="4">
          <bitfield caption="Gray Count Enable" mask="0x00000001" name="GCEN"/>
          <bitfield caption="Down Count" mask="0x00000002" name="DOWN"/>
        </register>
        <register caption="Counter Value (channel = 0)" name="TC_CV0" offset="0x10" rw="R" size="4">
          <bitfield caption="Counter Value" mask="0xFFFFFFFF" name="CV"/>
        </register>
        <register caption="Register A (channel = 0)" name="TC_RA0" offset="0x14" rw="RW" size="4">
          <bitfield caption="Register A" mask="0xFFFFFFFF" name="RA"/>
        </register>
        <register caption="Register B (channel = 0)" name="TC_RB0" offset="0x18" rw="RW" size="4">
          <bitfield caption="Register B" mask="0xFFFFFFFF" name="RB"/>
        </register>
        <register caption="Register C (channel = 0)" name="TC_RC0" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Register C" mask="0xFFFFFFFF" name="RC"/>
        </register>
        <register caption="Status Register (channel = 0)" name="TC_SR0" offset="0x20" rw="R" size="4">
          <bitfield caption="Counter Overflow Status (cleared on read)" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun Status (cleared on read)" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare Status (cleared on read)" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare Status (cleared on read)" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare Status (cleared on read)" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading Status (cleared on read)" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading Status (cleared on read)" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger Status (cleared on read)" mask="0x00000080" name="ETRGS"/>
          <bitfield caption="End of Receiver Transfer (cleared by writing TC_RCR or TC_RNCR)" mask="0x00000100" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full (cleared by writing TC_RCR or TC_RNCR)" mask="0x00000200" name="RXBUFF"/>
          <bitfield caption="Clock Enabling Status" mask="0x00010000" name="CLKSTA"/>
          <bitfield caption="TIOA Mirror" mask="0x00020000" name="MTIOA"/>
          <bitfield caption="TIOB Mirror" mask="0x00040000" name="MTIOB"/>
        </register>
        <register caption="Interrupt Enable Register (channel = 0)" name="TC_IER0" offset="0x24" rw="W" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
          <bitfield caption="End of Receiver Transfer" mask="0x00000100" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full" mask="0x00000200" name="RXBUFF"/>
        </register>
