Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMG54G19.xml
        <register caption="Transmit Counter Register" name="TWIHS_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="TWIHS_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="TWIHS_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="TWIHS_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="TWIHS_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="TWIHS_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="TWIHS_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
      </register-group>
      <value-group caption="" name="TWIHS_MMR__IADRSZ">
        <value caption="No internal device address" name="NONE" value="0x0"/>
        <value caption="One-byte internal device address" name="_1_BYTE" value="0x1"/>
        <value caption="Two-byte internal device address" name="_2_BYTE" value="0x2"/>
        <value caption="Three-byte internal device address" name="_3_BYTE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TWIHS_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0" name="PASSWD" value="0x545749"/>
      </value-group>
    </module>
    <module caption="Universal Asynchronous Receiver Transmitter" name="UART" version="6418N">
      <register-group name="UART">
        <register caption="Control Register" name="UART_CR" offset="0x0000" rw="W" size="4">
          <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield caption="Reset Status" mask="0x00000100" name="RSTSTA"/>
          <bitfield caption="Request Clear" mask="0x00001000" name="REQCLR"/>
        </register>
        <register caption="Mode Register" name="UART_MR" offset="0x0004" rw="RW" size="4">
          <bitfield caption="Receiver Digital Filter" mask="0x00000010" name="FILTER" values="UART_MR__FILTER"/>
          <bitfield caption="Parity Type" mask="0x00000E00" name="PAR" values="UART_MR__PAR"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="UART_MR__CHMODE"/>
        </register>
        <register caption="Interrupt Enable Register" name="UART_IER" offset="0x0008" rw="W" size="4">
          <bitfield caption="Enable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Enable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Enable End of Receive Transfer Interrupt" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Enable End of Transmit Interrupt" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Enable Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Enable Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Enable Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Enable TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Enable Buffer Empty Interrupt" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Enable Buffer Full Interrupt" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Enable Comparison Interrupt" mask="0x00008000" name="CMP"/>
        </register>
        <register caption="Interrupt Disable Register" name="UART_IDR" offset="0x000C" rw="W" size="4">
          <bitfield caption="Disable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Disable End of Receive Transfer Interrupt" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="Disable End of Transmit Interrupt" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Disable Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Disable Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Disable Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Disable TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Disable Buffer Empty Interrupt" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Disable Buffer Full Interrupt" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Disable Comparison Interrupt" mask="0x00008000" name="CMP"/>
        </register>
